tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

tap "gaborcsardi/rim"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "koekeishiya/formulae"
tap "r-lib/rig"

brew "bat"
brew "openssl@1.1"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "git-delta"
brew "glow"
brew "go"
brew "gzip"
brew "helix"
brew "jq"
brew "lazygit"
brew "libgit2"
brew "make"
brew "neovim"
brew "openjdk"
brew "pandoc"
brew "postgresql@14"
brew "pyenv"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "tmux"
brew "wget"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "dbeaver-community"
cask "discord"
cask "fig"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "notion"
cask "qlmarkdown"
cask "raycast"
cask "rig"
cask "rstudio"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "zoom"
